{"30":"0","32":"2","36":"6","1497":"© ","14963":"USA","26405793":"GERMANY","44751163":"W Ventures GmbH","-45b0dad8":"Portfolio","-64104400":"Contact","9dcfa":"中文","144c6809":"W Ventures","45aac":" — ","-21ab2ccd":"From seed to growth","-69a0e80c":" we counsel, invest, and support ventures.","-13e0cf3b":"Let's talk","-2e7e803":"W Ventures is a Berlin-based venture capital firm aiming to foster innovation along private equity and VC partners.","-2d422d1f":"What we do","3e28c":"— ","-257e9768":"Our mission","-c65595d":" is to offer a complete framework for the acceleration of digital business ideas for leading international companies in key B2B and B2C sectors.","-618e8c8c":"Energy / Industrial / Commerce / Security, Digital Health / Mobility / Finance / IT / Real Estate & Construction / Business Software / Fintech / InsurTech / Manufacturing & Industry 4.0 / Marketing / Media / Mobility & Logistics.","-7352042":"Notable partnerships ","11b7ed25":"we have proudly backed and nurtured throughout the years","3f3c62fd":"Growing and thriving in their respective industries, setting new standards for excellence and innovation.","-37b57ac8":"See our full Portfolio","-214cf3a9":"We provide guidance ","18922e20":"and support across a wide spectrum of business domains, with a focus in the USA, Europe and Asia/ Japan.","-4080dc20":"Business","-77a16025":"From expert business management and administration to strategic consultancy, from marketing to data analysis, we are your partners in growth.","518a8826":"get in touch with us","254a1d40":"Founding","334c3fff":"Established in 2013, W Ventures, headquartered in Germany's cities of Berlin and Dortmund, is here to assist you in achieving your financial objectives.","4fd29e":"Jochen M. Wilms is an experienced business leader with 25+ years in tech, industry, and investments. He started in retail, became a general manager during Bertelsmann's digital transition, and later led international firms in the Building Industry. Jochen chairs Luqom Group, invests in digital tech and industry companies through W Ventures.","55ca5a70":"Jochen M. Wilms, Tech Investor/Chairman in leading international companies","305ce7ba":"Finance","3de28db5":"We specialize in financial consulting for startups and emerging businesses. We offer valuable guidance on investments, extend venture capital loans, and excel in fund management, all through strategic collaborations with prominent international venture capitalists, private equity partners, family offices, and top-tier technology partners.","2f7835fc":"Specialties","300f7d04":"Internet / E-Commerce / Enterprise IT / Venture Capital / Seed Funding / Business Intelligence / Digital Transformation / Performance Marketing / B2B / B2C / Co-Creation / Product Development / Investment / Family Office / Private Equity / Consulting / Startup and Construction.","-351386d8":"Coaching","5b8adbef":"Our specialization lies in offering comprehensive coaching services encompassing the fields of finance, economics, and management.","-3e4d2cce":"Coaching *","33b01a":"noun","-107fe12e":"/ˈkoʊtʃɪŋ/","-5172ef00":"The act of assisting clients in setting specific, measurable, achievable, relevant, and time-bound (SMART) goals for their businesses.","-17da4b41":"* Our coaching include but is not limited to the following services: Mentorship, Goal Setting, Skill Development, Accountability, Problem-Solving, Networking, Confidence Building, Continuous Improvement","1b574024":"Venture Capital from seed to growth, Strategy Consulting, Ideation, Validation of models, Prototyping, Business Development & Project Management.","-19fac499":"From seed to growth we counsel, invest, and support ventures.","-f790482":"pitch us","-ef1612a":"Drag n' Drop ","15375bde":"your Pitch Deck & get a chance to secure funding for your next business venture.","617181c9":"Pitch Deck","765a724":"Transform your idea into reality, share us your pitch deck and we'll get back to you as soon as possible.","-5d5b62a7":"Upload a PDF of your Pitch Deck","-853e4c":"If you intend to upload your pitch deck as a PDF file and it contains critical and/or confidential information, please ensure that your PDF file is password-protected. Max PDF size should be 10Mo.","-5ea96d68":" Pitch Deck URL","57aecf8d":"Alternative","-5f982c39":"Alternatively, you can also share a link to your Pitch Deck, — we recommend using Slidebean for this purpose.","-5001dd0c":"slidebean.com","4bcd296c":"Slidebean.com is a web-based platform that provides tools for creating professional and visually appealing presentation slides. It is designed to assist users, particularly business professionals and entrepreneurs, in crafting effective presentations with ease.","ff41d7c":"Full Name","14c73b02":"& Email","2c4541da":"Kindly provide us with your complete name and your professional email address, please.","93f3dfb":"We value your identity and how you wish to be addressed. When you share your full name with us, please also include the pronoun you prefer.","5928cf17":"Prior to sending your message, take a moment to double-check and confirm the accuracy of your email address.","6aabaf28":"Target fundraising amount in USD","7c171f44":"fundraising","16dc34b8":"Setting a target fundraising amount serves several essential purposes. First and foremost, it provides clarity and focus for the fundraising efforts.","400e1d13":"Furthermore, a well-defined fundraising target enables proper planning and allocation of resources. It guides organizers in creating a fundraising strategy, setting timelines, and identifying the most effective fundraising methods.","-407b6e52":"Elevator pitch","1b4decc0":"— make it count","498d320":"Pitch","5778fc77":"/pɪtʃ/","-53dbbe3e":"In a world of information overload, a well-crafted oneliner pitch is your key to grabbing someone's attention and making a memorable impression in just a few seconds.","6ffc699d":"By clicking ","-5474ea51":"\"Send us your proposal\"","6a58b3b9":" on this contact form, you acknowledge and agree to the terms and conditions outlined in the privacy policy of W Ventures.","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","70472c3e":"New technologies, ","-4aabb04b":"trends, and market shifts can disrupt industries overnight.","-2fe3ed62":"Access to the latest information fosters innovation. It enables individuals and organizations to discover new solutions, ideas, and opportunities.","521213ec":"Follow us on Linkedin","61e01202":"371 followers","c593":"1mo","-7e1d7090":"...see more","-23e8220c":"comments","-37b3aaad":"repost","2423b7":"Like","-642179c1":"Comment","-6e4ebe8d":"Repost","2743a8":"Send","3d503d2b":"No items found.","-730bfe89":"Have a ","-30a6a418":"vision","41f":" ?","-683917f7":"Let's talk.","766493c2":"Berlin","3c5f2f2f":"Goethestraße 81","-5a3a5d96":"10623 Berlin","50c20b0b":"Dortmund","-5bd4948":"Lissaboner Allee 14","-66c89176":"4269 Dortmund","-4d607b96":"info@wventures.de","-1be2c5b4":"+49 30 318 00 443","29ce40":"YYYY","3fb19171":" W Ventures GmbH. All rights reserved.","1601c327":"Webdesign ❤️ ","-67104443":"anthonysalamin.ch","-5767796a":"En cliquant sur ","6af87d0b":"\"Accepter\"","-1eb4ce39":", vous acceptez que tous les cookies soient stockés sur votre appareil afin d'améliorer la navigation sur le site et d'analyser l'utilisation du site. Consultez notre ","6ad7d527":"politique de confidentialité","1442d302":" pour plus d'informations.","-6bfbaf20":"Préférences","-5c134542":"Refuser","-7c16fc2b":"Accepter","2dc7a23e":"Centre de préférences pour la politique de protection de la vie privée","5719b980":"Lorsque vous visitez des sites web, ceux-ci peuvent stocker ou récupérer des données dans votre navigateur. Ce stockage est souvent nécessaire pour la fonctionnalité de base du site web. Il peut être utilisé à des fins de marketing, d'analyse et de personnalisation du site, par exemple pour enregistrer vos préférences. La protection de la vie privée est importante pour nous, c'est pourquoi vous avez la possibilité de désactiver certains types de stockage qui ne sont pas nécessaires au fonctionnement de base du site web. Le blocage de certaines catégories peut avoir un impact sur votre expérience du site web.","-1bb35ed1":"Rejeter tous les cookies","-79c29fd3":"Accepter tous les cookies","351868e0":"Gérer les préférences en matière de consentement par catégorie","16a393aa":"Essentiel","-5c954f1a":"Toujours actif","-7b9165df":"Ces éléments sont nécessaires pour permettre le fonctionnement de base du site web.","3fc9ea06":"Marketing","16a3932e":"Essential","-7979fb1e":"Ces éléments sont utilisés pour diffuser des publicités plus pertinentes pour vous et vos centres d'intérêt. Ils peuvent également être utilisés pour limiter le nombre de fois que vous voyez une publicité et mesurer l'efficacité des campagnes publicitaires. Les réseaux publicitaires les placent généralement avec l'autorisation de l'exploitant du site web.","6fc5ea07":"Personnalisation","-1d143c52":"Ces éléments permettent au site web de se souvenir des choix que vous faites (tels que votre nom d'utilisateur, votre langue ou la région dans laquelle vous vous trouvez) et de fournir des fonctions améliorées et plus personnelles. Par exemple, un site web peut vous fournir des bulletins météorologiques locaux ou des informations sur la circulation en stockant des données sur votre position actuelle.","2fb3f453":"Analyse","-46635a4":"Ces éléments aident l'opérateur du site web à comprendre comment son site fonctionne, comment les visiteurs interagissent avec le site et s'il y a des problèmes techniques. Ce type de stockage ne recueille généralement pas d'informations permettant d'identifier un visiteur.","-c5b78c0":"Confirmer mes préférences et fermer","-104e22e5":"Showing ","-24a74397":" matches from ","f56f680":" Ventures","-289a734c":"highlight","2b99ed2e":"Clear all","7270c3a2":"Industry Segments","5b":"[","5d":"]","3016773e":"Locations","5ead6393":"Germany","77df12ee":"Canada","2257118f":"Filter Ventures by","1477a":"Tag","-15752607":"Sort by","-110ef5f0":"Name (A/Z)","-36974c30":"Name (Z/A)","30fa2432":" Status","7c8ae25d":"Exited","74946b26":"Active","752a03d5":"Location","2c":",","-2ed1df42":"Oops, no results found.","-6239bf77":"An idea ?","-1c6b203d":"please scroll","2545b7a9":"we have proudly backed and nurtured throughout the years.","3d97730a":"As an investor, W Ventures is a member of the Federal Association of German Startups","3ab5ccc1":"Together, we are working to improve the financing conditions for startups. On the one hand, this means modernizing the economic and financial policy framework and, on the other hand, the relevant networks for exchanging experience and know-how.","754d54a5":"let's talk","-7c732f28":"your Pitch Deck & get your next business funded.","617183b9":"Pitch Desk","-1f86102c":"Drag n' Drop your Pitch Deck — get funded.","7d18ec1c":"Since you’re here, you must have a business proposal for us, and we can’t wait to see it. Fill in the form and our associates will reach out to you ASAP.","478e6d5":"Name ","2a":"*","7bec1424":"Email ","310da432":"Elevator pitch ","-25e7687d":"Target fundraising amount","-503fb5e6":"up to $500K","449247ce":"$500K — $1M","-6052d72e":"$1M — $3M","-2de965a8":"Share a Pitch Deck URL","220fbbb9":"Upload a Pitch Deck PDF","-4195eb9a":"If you intend to upload your pitch deck and it contains critical and/or confidential information, please ensure that your PDF file is password-protected. Max PDF size should be 10Mo. By submitting this form, you consent to our privacy policy.","10eaabfc":"your Pitch Deck & get funded."}